In [1]:
import pandas as pd

In [3]:
s = pd.Series([10,20,30,40,50])
s

0    10
1    20
2    30
3    40
4    50
dtype: int64

In [4]:
s.dtype

dtype('int64')

In [5]:
s.values

array([10, 20, 30, 40, 50])

In [6]:
s.index

RangeIndex(start=0, stop=5, step=1)

In [7]:
print(s.name)

None

In [10]:
s
s.name = "calories"
s

0    10
1    20
2    30
3    40
4    50
Name: calories, dtype: int64

In [11]:
s

0    10
1    20
2    30
3    40
4    50
Name: calories, dtype: int64

In [12]:
#Indexing
s[0]

np.int64(10)

In [13]:
s[0:2] #start (included) : step value (values to jump)

0    10
1    20
Name: calories, dtype: int64

In [14]:
#iloc -> location based indexing
s.iloc[3]

np.int64(40)

In [15]:
s.iloc[[1,3,4]]

1    20
3    40
4    50
Name: calories, dtype: int64

In [19]:
index = ["apple","banana","orange","grapes","mango"]
s.idx= index
print(s.index)

Index(['apple', 'banana', 'orange', 'grapes', 'mango'], dtype='object')

In [20]:
s['orange']

np.int64(30)

In [ ]:
#loc->label based indexing
#s.loc[['apple','orange']] 
#s.iloc[['apple','orange']]
s.iloc[[0,2]]

apple     10
orange    30
Name: calories, dtype: int64

In [30]:
#in label based indexing your start as well as stop value both are included in the output
s['apple':'grapes']

apple     10
banana    20
orange    30
grapes    40
Name: calories, dtype: int64

In [31]:
fruit_protien  = {
    "Avocado":2.0, #grams of protien
     "Guava": 2.6,
    "Blackberries": 2.0,
    "Oranges": 0.9,
    "Banana": 1.1,
    "Apples": 0.3,
    "Kiwi": 1.1,
    "Pomegranate": 1.7,
    "Mango": 0.8,
    "Cherries": 1.0

}

In [34]:
s2 = pd.Series(fruit_protien,name = "Protien")
s2

Avocado         2.0
Guava           2.6
Blackberries    2.0
Oranges         0.9
Banana          1.1
Apples          0.3
Kiwi            1.1
Pomegranate     1.7
Mango           0.8
Cherries        1.0
Name: Protien, dtype: float64

In [35]:
#Conditional selection
s2[s2>1]

Avocado         2.0
Guava           2.6
Blackberries    2.0
Banana          1.1
Kiwi            1.1
Pomegranate     1.7
Name: Protien, dtype: float64

In [36]:
#logical operators : and or not
s2[(s2>0.5) | (s2<=2)]

Avocado         2.0
Guava           2.6
Blackberries    2.0
Oranges         0.9
Banana          1.1
Apples          0.3
Kiwi            1.1
Pomegranate     1.7
Mango           0.8
Cherries        1.0
Name: Protien, dtype: float64

In [37]:
#not operation:
s2[~(s2>1)]

Oranges     0.9
Apples      0.3
Mango       0.8
Cherries    1.0
Name: Protien, dtype: float64

In [38]:
#Modifying the series
s2["Mango"] = 4.9
s2

Avocado         2.0
Guava           2.6
Blackberries    2.0
Oranges         0.9
Banana          1.1
Apples          0.3
Kiwi            1.1
Pomegranate     1.7
Mango           4.9
Cherries        1.0
Name: Protien, dtype: float64

In [40]:
import numpy as np
ser = pd.Series(['a',np.nan,1,np.nan,2])
ser.notnull().sum()

np.int64(3)

In [41]:
#DataFrame
data = {
    "Name":["Alice","Bob","Charlie","David","Eve","Alice"],
    "Age": [25, 30, 35, np.nan, 29, 25],
    "Department": ["HR", "IT", "Finance", "IT", "HR", "HR"],
    "Salary": [50000, 60000, 70000, 62000, np.nan, 50000]
}

In [42]:
data

{'Name': ['Alice', 'Bob', 'Charlie', 'David', 'Eve', 'Alice'],
 'Age': [25, 30, 35, nan, 29, 25],
 'Department': ['HR', 'IT', 'Finance', 'IT', 'HR', 'HR'],
 'Salary': [50000, 60000, 70000, 62000, nan, 50000]}

In [43]:
df = pd.DataFrame(data)
df

      Name   Age Department   Salary
0    Alice  25.0         HR  50000.0
1      Bob  30.0         IT  60000.0
2  Charlie  35.0    Finance  70000.0
3    David   NaN         IT  62000.0
4      Eve  29.0         HR      NaN
5    Alice  25.0         HR  50000.0

In [44]:
df.head(2)

    Name   Age Department   Salary
0  Alice  25.0         HR  50000.0
1    Bob  30.0         IT  60000.0

In [ ]:
df.tail(3)

In [45]:
df.loc[1:2,["Age","Department"]]

    Age Department
1  30.0         IT
2  35.0    Finance

In [46]:
df[["Age","Department"]]

    Age Department
0  25.0         HR
1  30.0         IT
2  35.0    Finance
3   NaN         IT
4  29.0         HR
5  25.0         HR

In [48]:
df.drop("Age",axis=1)

      Name Department   Salary
0    Alice         HR  50000.0
1      Bob         IT  60000.0
2  Charlie    Finance  70000.0
3    David         IT  62000.0
4      Eve         HR      NaN
5    Alice         HR  50000.0

In [49]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 6 entries, 0 to 5
Data columns (total 4 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   Name        6 non-null      object
 1   Age         5 non-null      float64
 2   Department  6 non-null      object
 3   Salary      5 non-null      float64
dtypes: float64(2), object(2)
memory usage: 320.0+ bytes

In [50]:
#Broadcasting
df["Salary"] = df["Salary"]+5000
df["Salary"]

0    55000.0
1    65000.0
2    75000.0
3    67000.0
4        NaN
5    55000.0
Name: Salary, dtype: float64

In [51]:
#renaing columns
df.rename(columns = {"Department":"Dept"},inplace=True)
df

      Name   Age     Dept   Salary
0    Alice  25.0       HR  55000.0
1      Bob  30.0       IT  65000.0
2  Charlie  35.0  Finance  75000.0
3    David   NaN       IT  67000.0
4      Eve  29.0       HR      NaN
5    Alice  25.0       HR  55000.0

In [52]:
df["Dept"].unique()

array(['HR', 'IT', 'Finance'], dtype=object)

In [53]:
df["Promoted Salary"] = df["Salary"]*10
df

      Name   Age     Dept   Salary  Promoted Salary
0    Alice  25.0       HR  55000.0         550000.0
1      Bob  30.0       IT  65000.0         650000.0
2  Charlie  35.0  Finance  75000.0         750000.0
3    David   NaN       IT  67000.0         670000.0
4      Eve  29.0       HR      NaN              NaN
5    Alice  25.0       HR  55000.0         550000.0

In [54]:
#Data cleaning
df.isnull().sum()

Name               0
Age                1
Dept               0
Salary             1
Promoted Salary    1
dtype: int64

In [55]:
df.dropna(how="any") #any row that had any null value

      Name   Age     Dept   Salary  Promoted Salary
0    Alice  25.0       HR  55000.0         550000.0
1      Bob  30.0       IT  65000.0         650000.0
2  Charlie  35.0  Finance  75000.0         750000.0
5    Alice  25.0       HR  55000.0         550000.0

In [ ]:
df.dropna(how="all") #if all the values in any row are null then we drop that row

      Name   Age     Dept   Salary  Promoted Salary
0    Alice  25.0       HR  55000.0         550000.0
1      Bob  30.0       IT  65000.0         650000.0
2  Charlie  35.0  Finance  75000.0         750000.0
3    David   NaN       IT  67000.0         670000.0
4      Eve  29.0       HR      NaN              NaN
5    Alice  25.0       HR  55000.0         550000.0

In [57]:
df

      Name   Age     Dept   Salary  Promoted Salary
0    Alice  25.0       HR  55000.0         550000.0
1      Bob  30.0       IT  65000.0         650000.0
2  Charlie  35.0  Finance  75000.0         750000.0
3    David   NaN       IT  67000.0         670000.0
4      Eve  29.0       HR      NaN              NaN
5    Alice  25.0       HR  55000.0         550000.0

In [58]:
df['Age'].fillna(df["Age"].mean())

0    25.0
1    30.0
2    35.0
3    28.8
4    29.0
5    25.0
Name: Age, dtype: float64

In [59]:
df["Salary"].fillna(df["Salary"].median())

0    55000.0
1    65000.0
2    75000.0
3    67000.0
4    65000.0
5    55000.0
Name: Salary, dtype: float64

In [ ]:
df["Age"].fillna(method="ffill") #top teke search suru kore je value ke null pabe tar ager value diye update kore dibe

/var/folders/v7/hc7jkjb96vs59qcsym8x3v240000gn/T/ipykernel_25465/310954073.py:1: FutureWarning: Series.fillna with 'method' is deprecated and will raise in a future version. Use obj.ffill() or obj.bfill() instead.
  df["Age"].fillna(method="ffill")

0    25.0
1    30.0
2    35.0
3    35.0
4    29.0
5    25.0
Name: Age, dtype: float64

In [61]:
df["Age"].fillna(method="bfill") #ffill er ulta ta bfill=bakward fill

/var/folders/v7/hc7jkjb96vs59qcsym8x3v240000gn/T/ipykernel_25465/386557127.py:1: FutureWarning: Series.fillna with 'method' is deprecated and will raise in a future version. Use obj.ffill() or obj.bfill() instead.
  df["Age"].fillna(method="bfill") #ffill er ulta ta bfill=bakward fill

0    25.0
1    30.0
2    35.0
3    29.0
4    29.0
5    25.0
Name: Age, dtype: float64

In [63]:
df["Name"] = df["Name"].replace("Charlie","Rose")
df

    Name   Age     Dept   Salary  Promoted Salary
0  Alice  25.0       HR  55000.0         550000.0
1    Bob  30.0       IT  65000.0         650000.0
2   Rose  35.0  Finance  75000.0         750000.0
3  David   NaN       IT  67000.0         670000.0
4    Eve  29.0       HR      NaN              NaN
5  Alice  25.0       HR  55000.0         550000.0

In [67]:
df_dup = df[df.duplicated(keep="last")]
df_dup

    Name   Age Dept   Salary  Promoted Salary
0  Alice  25.0   HR  55000.0         550000.0

In [69]:
#invalid values:
#Lambda ->python

df["Promoted Salary"] = df["Promoted Salary"].apply(lambda x:x/10 if x>650000 else x)
df

    Name   Age     Dept   Salary  Promoted Salary
0  Alice  25.0       HR  55000.0         550000.0
1    Bob  30.0       IT  65000.0         650000.0
2   Rose  35.0  Finance  75000.0          75000.0
3  David   NaN       IT  67000.0          67000.0
4    Eve  29.0       HR      NaN              NaN
5  Alice  25.0       HR  55000.0         550000.0

In [77]:
#apply and lambda
def multiplying_age(x):
    return x/4

df["Age"] = df["Age"].apply(multiplying_age)
df

    Name   Age     Dept   Salary  Promoted Salary
0  Alice  25.0       HR  55000.0         550000.0
1    Bob  30.0       IT  65000.0         650000.0
2   Rose  35.0  Finance  75000.0          75000.0
3  David   NaN       IT  67000.0          67000.0
4    Eve  29.0       HR      NaN              NaN
5  Alice  25.0       HR  55000.0         550000.0

In [78]:
#apply and lambda
def multiplying_age(x):
    return x*2

df["Age"] = df["Age"].apply(multiplying_age)
df

    Name   Age     Dept   Salary  Promoted Salary
0  Alice  50.0       HR  55000.0         550000.0
1    Bob  60.0       IT  65000.0         650000.0
2   Rose  70.0  Finance  75000.0          75000.0
3  David   NaN       IT  67000.0          67000.0
4    Eve  58.0       HR      NaN              NaN
5  Alice  50.0       HR  55000.0         550000.0

In [80]:
#Joins and merge
department_info = {
    "Dept":["HR","IT","Finance"],
    "Location":["New York","San Francisco","Chicago"],
    "Manager": ["Laura", "Steve", "Nina"]
}
df2 = pd.DataFrame(department_info)
df2

      Dept       Location Manager
0       HR       New York   Laura
1       IT  San Francisco   Steve
2  Finance        Chicago    Nina

In [81]:
#concat
pd.concat([df,df2])

    Name   Age     Dept   Salary  Promoted Salary       Location Manager
0  Alice  50.0       HR  55000.0         550000.0            NaN     NaN
1    Bob  60.0       IT  65000.0         650000.0            NaN     NaN
2   Rose  70.0  Finance  75000.0          75000.0            NaN     NaN
3  David   NaN       IT  67000.0          67000.0            NaN     NaN
4    Eve  58.0       HR      NaN              NaN            NaN     NaN
5  Alice  50.0       HR  55000.0         550000.0            NaN     NaN
0    NaN   NaN       HR      NaN              NaN       New York   Laura
1    NaN   NaN       IT      NaN              NaN  San Francisco   Steve
2    NaN   NaN  Finance      NaN              NaN        Chicago    Nina

In [82]:
pd.merge(df,df2,on="Dept")

    Name   Age     Dept   Salary  Promoted Salary       Location Manager
0  Alice  50.0       HR  55000.0         550000.0       New York   Laura
1    Bob  60.0       IT  65000.0         650000.0  San Francisco   Steve
2   Rose  70.0  Finance  75000.0          75000.0        Chicago    Nina
3  David   NaN       IT  67000.0          67000.0  San Francisco   Steve
4    Eve  58.0       HR      NaN              NaN       New York   Laura
5  Alice  50.0       HR  55000.0         550000.0       New York   Laura